In [0]:
from pandas import DataFrame

In [0]:
dframe = DataFrame({'city':['Alma','Brian Head','Fox Park'], 'altitude':[3158,3000,2752]})

In [3]:
dframe

         city  altitude
0        Alma      3158
1  Brian Head      3000
2    Fox Park      2752

In [0]:
state_map = {'Alma':'Colorado', 'Brian Head':'Utah', 'Fox Park':'Wyoming'}

In [0]:
# state_mapとcityの値をマッピングしてstateカラムを作成する。
# 特定の列に関連の高いデータを追加する場合に有用
dframe['state'] = dframe['city'].map(state_map)

In [6]:
dframe

         city  altitude     state
0        Alma      3158  Colorado
1  Brian Head      3000      Utah
2    Fox Park      2752   Wyoming

In [0]:
dframe['key1'] = [0,1,2]

In [8]:
dframe

         city  altitude     state  key1
0        Alma      3158  Colorado     0
1  Brian Head      3000      Utah     1
2    Fox Park      2752   Wyoming     2